In [53]:
import pandas as pd
import mysql.connector as sql
from sqlalchemy import create_engine

In [54]:
db_connection = sql.connect(host='DELL5577', database='codebasics', user='root@localhost', password='root')

In [55]:
query = "SELECT * FROM customers"
df = pd.read_sql(query, db_connection)
df

C:\Users\nachi\AppData\Local\Temp\ipykernel_21176\344408884.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, db_connection)

   id    name phone_number
0   1  Donald   7326784567
1   2    Bill   7854862564
2   3    Modi   9564851547